garyPenhook/PyAvrOCD/svd/atmega329p.svd
        <register>
          <name>LCDDR8</name>
          <description>LCD Data Register 8</description>
          <addressOffset>0x10</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SEG124</name>
              <description>LCD memory bit segment</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG125</name>
              <description>LCD memory bit segment</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG126</name>
              <description>LCD memory bit segment</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG127</name>
              <description>LCD memory bit segment</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG128</name>
              <description>LCD memory bit segment</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG129</name>
              <description>LCD memory bit segment</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG130</name>
              <description>LCD memory bit segment</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEG131</name>
              <description>LCD memory bit segment</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDFRR</name>
          <description>LCD Frame Rate Register</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LCDCD</name>
              <description>LCD Clock Dividers</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6</name>
                  <description>6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7</name>
                  <description>7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDPS</name>
              <description>LCD Prescaler Selects</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKLCD_16</name>
                  <description>ClkLCD/16</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_64</name>
                  <description>ClkLCD/64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_128</name>
                  <description>ClkLCD/128</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_256</name>
                  <description>ClkLCD/256</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_512</name>
                  <description>ClkLCD/512</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_1024</name>
                  <description>ClkLCD/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_2048</name>
                  <description>ClkLCD/2048</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLKLCD_4096</name>
                  <description>ClkLCD/4096</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
